app/controllers/api/v1/applicants_roles_controller.rb

    def set_applicant_role
      @applicant_role = ApplicantsRole.find_by(applicant_id: params[:applicant_id], role_id: params[:role_id])
---
SELECT "applicants_roles".* FROM "applicants_roles" WHERE "applicants_roles"."applicant_id" = $1 AND "applicants_roles"."role_id" = $2 LIMIT $3  [["applicant_id", 980190962], ["role_id", 980190962], ["LIMIT", 1]]