app/controllers/api/v1/applicants_controller.rb

SELECT "applicants".* FROM "applicants" WHERE "applicants"."deleted_at" IS NULL AND (name ILIKE '%%')
---
  def index
    applicants = Applicant.search_by_name(params[:search])
    render json: applicants.map{|a| a.formatted_applicant}

UPDATE "applicants" SET "name" = $1, "updated_at" = $2 WHERE "applicants"."id" = $3  [["name", "Goy"], ["updated_at", "2023-05-26 18:18:50.769661"], ["id", 1]]
---
  def update
    if @applicant.update(applicant_params)

SELECT "roles".* FROM "roles" INNER JOIN "applicants_roles" ON "roles"."id" = "applicants_roles"."role_id" WHERE "roles"."deleted_at" IS NULL AND "applicants_roles"."applicant_id" = $1  [["applicant_id", 1]]
SELECT "applicants".* FROM "applicants" WHERE "applicants"."deleted_at" IS NULL AND 1=1
---
  def search_without_x_role
    applicants = Applicant.search_without_x_role(params[:role_id])
    render json: applicants.map{|a| a.formatted_applicant}

SELECT "applicants".* FROM "applicants" WHERE "applicants"."deleted_at" IS NULL AND "applicants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])