app/controllers/api/v1/applicants_controller.rb

SELECT "applicants".* FROM "applicants" WHERE (name ILIKE '%%')
---
  def index
    applicants = Applicant.search_by_name(params[:search])
    render json: applicants.map{|a| a.formatted_applicant}

INSERT INTO "applicants" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Maria"], ["phone", "87654321"], ["email", nil], ["created_at", "2023-05-25 23:57:56.300615"], ["updated_at", "2023-05-25 23:57:56.300615"]]
---
  def create
    applicant = Applicant.new(applicant_params)

    if applicant.save

DELETE FROM "applicants" WHERE "applicants"."id" = $1  [["id", 980190962]]
---
  def destroy
    if @applicant.destroy

SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])