app/controllers/api/v1/applicants_roles_controller.rb

    def create
        @applicant_role = ApplicantsRole.new(applicant_role_params)

        if @applicant_role.save
---
INSERT INTO "applicants_roles" ("applicant_id", "role_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["applicant_id", 3], ["role_id", 1], ["status", 0], ["created_at", "2023-05-26 18:21:28.779188"], ["updated_at", "2023-05-26 18:21:28.779188"]]

    def set_applicant_role
      @applicant_role = ApplicantsRole.find_by(applicant_id: params[:applicant_id], role_id: params[:role_id])
---
SELECT "applicants_roles".* FROM "applicants_roles" WHERE "applicants_roles"."applicant_id" = $1 AND "applicants_roles"."role_id" = $2 LIMIT $3  [["applicant_id", 1], ["role_id", 1], ["LIMIT", 1]]