app/controllers/api/v1/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."deleted_at" IS NULL AND (name ILIKE '%%')
---
  def index
    roles = Role.search_by_name(params[:search])
    render json: roles.map{|role| role.formatted_role}