app/controllers/api/v1/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE (name ILIKE '%%')
---
  def index
    roles = Role.search_by_name(params[:search])
    render json: roles.map{|role| role.formatted_role}

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Frontend"], ["created_at", "2023-05-25 23:58:25.287603"], ["updated_at", "2023-05-25 23:58:25.287603"]]
---
  def create
    role = Role.new(role_params)

    if role.save

UPDATE "roles" SET "name" = $1, "updated_at" = $2 WHERE "roles"."id" = $3  [["name", "test"], ["updated_at", "2023-05-26 00:03:10.225434"], ["id", 980190962]]
---
  def update
    if @role.update(role_params)

DELETE FROM "roles" WHERE "roles"."id" = $1  [["id", 980190962]]
---
  def destroy
    if @role.destroy

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_role
      @role = Role.find(params[:id])