app/models/applicant.rb

SELECT "applicants"."id" FROM "applicants" INNER JOIN "applicants_roles" ON "applicants"."id" = "applicants_roles"."applicant_id" WHERE "applicants"."deleted_at" IS NULL AND "applicants_roles"."role_id" = $1  [["role_id", 1]]
---
    scope :search_without_x_role, -> (role_id) { where.not(id: Role.find(role_id).applicants.pluck(:id)) }

SELECT "roles".* FROM "roles" INNER JOIN "applicants_roles" ON "roles"."id" = "applicants_roles"."role_id" WHERE "roles"."deleted_at" IS NULL AND "applicants_roles"."applicant_id" = $1  [["applicant_id", 1]]
---
    def formatted_applicant
        {
            applicant: {
                id: self.id,
                name: self.name,
                email: self.email,
                phone: self.phone,
                avatar_url: self.avatar_url,
            },
            roles: self.roles.map{|r| r.show_status(self.id)}

SELECT "applicants_roles".* FROM "applicants_roles" WHERE "applicants_roles"."applicant_id" = $1 AND "applicants_roles"."role_id" = $2 LIMIT $3  [["applicant_id", 1], ["role_id", 1], ["LIMIT", 1]]
---
    def show_status(role_id)
        {
            id: self.id,
            name: self.name,
            email: self.email,
            phone: self.phone,
            avatar_url: self.avatar_url,
            status: self.applicants_roles.find_by(role_id: role_id).status