app/models/role.rb

    def formatted_role
        {
            role: self,
            applicants: self.applicants.map{|a| a.show_status(self.id)}
---
SELECT "applicants".* FROM "applicants" INNER JOIN "applicants_roles" ON "applicants"."id" = "applicants_roles"."applicant_id" WHERE "applicants"."deleted_at" IS NULL AND "applicants_roles"."role_id" = $1  [["role_id", 1]]

    def show_status(applicant_id)
        {
            id: self.id,
            name: self.name,
            status: self.applicants_roles.find_by(applicant_id: applicant_id).status
---
SELECT "applicants_roles".* FROM "applicants_roles" WHERE "applicants_roles"."role_id" = $1 AND "applicants_roles"."applicant_id" = $2 LIMIT $3  [["role_id", 1], ["applicant_id", 1], ["LIMIT", 1]]